БСП_ВА.VA_INTEGR/src/InformationRegisters/ВАИНТ_НастройкиТестирования/ВАИНТ_НастройкиТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВАИНТ_НастройкиТестирования</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>НастройкаТестирования</name>
    <type>
      <types>EnumRef.ВАИНТ_НастройкиТестирования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БСП_ВА.VA_INTEGR/src/CommonModules/ВАИНТ_ТестированиеВызовСервера/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Возвращает указанную настройку тестирования.
// 
// Параметры:
// 	НастройкаТестирования - ПеречислениеСсылка.ВАИНТ_НастройкиТестирования - настройка, значение которой требуется вернуть.
// Возвращаемое значение:
// 	Произвольный - Значение настройки. Если настройка не задана возвращается Неопределено.
Функция ЗначениеНастройкиТестирования(НастройкаТестирования) Экспорт
	Запись = РегистрыСведений.ВАИНТ_НастройкиТестирования.СоздатьМенеджерЗаписи();
	Запись.НастройкаТестирования = НастройкаТестирования;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ЗначениеНастройки;
	Иначе
		СообщениеПользователю = "Значение настройки " + НастройкаТестирования + " не задано."; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
	КонецЕсли;
КонецФункции

// Удалить объекты, созданные при тестировании.
Процедура УдалитьОбъектыСозданныеПриТестировании() Экспорт
	ВАИНТ_ТестированиеСервер.УдалитьОбъектыСозданныеПриТестировании();
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Описание элемента тестирования.
// 
// Параметры:
//  ИмяФормы - Строка - Имя формы
// 
// Возвращаемое значение:
//  Структура - Описание элемента тестирования:
// * ТипВладельца - Строка -
// * ИмяВладельца - Строка -
// * Формы - Массив из Форма -
Функция ОписаниеЭлементаТестирования(ИмяФормы) Экспорт
	Возврат ВАИНТ_ТестированиеСервер.ОписаниеОбъектаПоИмениФормы(ИмяФормы);
КонецФункции

// Установить статус авто тестирования.
// 
// Параметры:
//  ТестыВыполняются - Булево - Истина, если тесты выполняются.
Процедура УстановитьСтатусАвтоТестирования(ТестыВыполняются) Экспорт
	Если ВАИНТ_ТестированиеСерверПовтИсп.ЕстьПодсистемаАвтоТестирование() Тогда
		ПараметрыСеанса.АвтоТестыВыполняются = ТестыВыполняются;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
